package javaexp.a02_var_type;

public class A02_0506 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub


/*
1. 모듈화란 무엇이고 왜 필요할까? 

모듈화 1단계 메서드,모인게 클래스,다음단계 패키지 , 컴파일된 클래스 = 프레임워크 됨.
	프로그램의 재활용, 효과적인 메모리 사용을 위해서 사용된다.
	메서드를 통해 기능을 선언하였다가 해당 메서드를 호출하면 그 기능이 수행되게 처리된다.
	여러개의 메서드, 여러개의 속성 모여서 모듈화를 처리하는 것이 클래스/객체이다.
	클래스가 여러개 모여서 처리하는 단위가 패키지 ==> 패키징화하여 처리하는
		프로그램 *.jar로 프로그램을 모듈단위로 처리하여 모여서 프레임웍으로
		사용된다.
	상속을 통한 효과적인 처리.

2.자바에서 메서드는 어떤 용로도 활욜될까?
	리턴타임 메서드명(입력값){
		//필요로 하는 프로세스 처리
		return 리턴할 데이터;
	}
	모듈화의 첫단계로 자주 사용되는 기능 코드를 선언하여, 메서드명(입력값)형식으로
	호출하는 것을 말한다. 자바에서 메서드는 클래스의 구성요소로 사용된다. 

3. 자바의 코드와 실제행되는 영역을 차이점은 어떤 것이 있을까요?
	코드는 class로 선언되어 있는 것을 말하고,
	class에 선언된 코드가 메모리에 로딩되어 수행되는 것을 객체라고 한다.
	class와 객체는 밀접한 연관관계를 가지고 있다..

	class로 만들어진 소스 자체로는 프로그램 처리를 하지 못 한다.
	비유로 건물의 도면과 같은 역할을 한다.
	건축물이 객체라면 class로는 도면이라고 할 수 있다.
	하나의 도면으로 여러개의 건축물을 만들 수 있나요? 네
	하나의 클래스로 여러 개의 객체를 만들 수 있다.!!
		
	
4. 클래스의 구성 요소가 어떤 것이 있을까요?

5. 프로그램에서 보안이란 어떤 용도로 쓰일까요?
	적절한 범위에서 접근이 필요하게 처리
	메모리, 데이터 접근
	프로그램도 특정한 메모리의 데이터는 한정된 범위내에서
	데이터를 처리하지 않으면, 문제가 발생한다.
	접근에 대한 설정을 하지 않으면 이런 문제가 발생한다.
	

6. 소스의 재활용의 방법은 어떤 것이 있을까?

7. 객체지향 프로그램에서 상속이란 어떤 의미가 있을까?
 */
	
	}

}
